blog/app/views/user_teams/index.html.erb

SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."team_id" = ? AND "user_teams"."user_id" = ? LIMIT ?  [["team_id", 3], ["user_id", 17], ["LIMIT", 1]]
---
    <p>
    <%= link_to "Leave", user_team_path(UserTeam.find_by(team_id:team.id,user_id:session[:user_id]).id), data: {

SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."team_id" = ? AND "user_teams"."saw_last" = ?  [["team_id", 2], ["saw_last", 1]]
---

    <% unless UserTeam.where(team_id:team.id,saw_last:false).blank?%>