blog/app/views/contacts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", 18], ["LIMIT", 1]]
---
      <li>
        <%= User.find_by(id: contact.to_user_id).username %> <%= link_to "Send a message" , private_message_path%>