blog/app/views/teams/show.html.erb

  <li>
  <%= User.find_by(id:@team.owner_id).username%> Owner
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]