rest_api/todos-api/app/controllers/items_controller.rb

    def create
      @todo.items.create!(item_params)
---
INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "item"], ["done", 0], ["todo_id", 7], ["created_at", "2024-09-09 21:33:39.142019"], ["updated_at", "2024-09-09 21:33:39.142019"]]

    def update
      @item.update(item_params)
---
UPDATE "items" SET "name" = ?, "done" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Take the dog on a walk"], ["done", 1], ["updated_at", "2024-09-18 12:15:01.530004"], ["id", 6]]

    def set_todo
      @todo = Todo.find(params[:todo_id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def set_todo_item
      @item = @todo.items.find_by!(id: params[:id]) if @todo
---
SELECT "items".* FROM "items" WHERE "items"."todo_id" = ? AND "items"."id" = ? LIMIT ?  [["todo_id", 9], ["id", 9], ["LIMIT", 1]]