rest_api/todos-api/app/controllers/todos_controller.rb

    def create
      @todo = Todo.create!(todo_params)
---
INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Mozart"], ["created_by", "1"], ["created_at", "2024-09-08 16:36:03.899813"], ["updated_at", "2024-09-08 16:36:03.899813"]]

    def update
      @todo.update(todo_params)
---
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Betoven"], ["updated_at", "2024-09-08 16:37:26.492414"], ["id", 1]]

    def destroy
      @todo.destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]