rest_api/todos-api/app/controllers/todos_controller.rb

    def index
      @todos = Todo.where(created_by:session[:user_id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."created_by" IS NULL