rest_api/todos-api/app/controllers/users_controller.rb

    def create
        @user = User.create(signup_params)
---
INSERT INTO "users" ("username", "password", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "username"], ["password", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2024-09-08 21:44:19.455862"], ["updated_at", "2024-09-08 21:44:19.455862"]]