blog/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def index
    @articles = Article.all
    @current_user = User.find_by_id(session[:user_id]) #<%= @current_user.username %>

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def show
    @article = Article.find(params[:id])
    @current_user = User.find_by_id(session[:user_id])

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "123"], ["body", "123123123123123"], ["created_at", "2024-06-01 13:21:24.050537"], ["updated_at", "2024-06-01 13:21:24.050537"], ["status", "public"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save