blog/app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = ? LIMIT ?  [["user_id", 17], ["LIMIT", 1]]
---
  def index
    @contacts = Contact.where(user_id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "4"], ["LIMIT", 1]]
INSERT INTO "contacts" ("user_id", "to_user_id", "blocked", "last_message", "last_saw", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 17], ["to_user_id", 20], ["blocked", nil], ["last_message", nil], ["last_saw", nil], ["created_at", "2024-09-04 19:00:27.158539"], ["updated_at", "2024-09-04 19:00:27.158539"]]
---
  def create
    #@contact = Contact.new
    @to_user = User.find_by(username: params[:username])
    if @to_user
      @c_new = Contact.new(user_id: session[:user_id] , to_user_id:@to_user.id)
      @c_new.save