blog/app/controllers/messengers_controller.rb

    def index
      @messengers = Messenger.where(user_id: session[:user_id])
      @messengers_c = @messengers.where(status:"contact")
      @messengers_m = @messengers.where(status:"messenger")
      @messengers_b = @messengers.where(status:"blocked")
      @teams_m = UserTeam.where(user_id: session[:user_id],saw_last:false)
---
SELECT "messengers".* FROM "messengers" WHERE "messengers"."user_id" = ? LIMIT ?  [["user_id", 17], ["LIMIT", 1]]
SELECT "messengers".* FROM "messengers" WHERE "messengers"."user_id" = ? AND "messengers"."status" = ?  [["user_id", 18], ["status", "contact"]]
SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."user_id" = ? AND "user_teams"."saw_last" = ?  [["user_id", 17], ["saw_last", 0]]

    def create
      #@messenger = Messenger.new
      @to_user = User.find_by(username: params[:username])
      if (@to_user && Messenger.where(user_id: session[:user_id] , to_user_id:@to_user.id , status: "contact").blank?)
        @c_new = Messenger.new(user_id: session[:user_id] , to_user_id:@to_user.id , status: "contact", saw_last:true)
        @c_new.save
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "1"], ["LIMIT", 1]]
SELECT "messengers".* FROM "messengers" WHERE "messengers"."user_id" = ? AND "messengers"."to_user_id" = ? AND "messengers"."status" = ?  [["user_id", 18], ["to_user_id", 17], ["status", "contact"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
INSERT INTO "messengers" ("user_id", "to_user_id", "status", "saw_last", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 18], ["to_user_id", 17], ["status", "contact"], ["saw_last", 1], ["created_at", "2024-09-05 20:08:56.693896"], ["updated_at", "2024-09-05 20:08:56.693896"]]

    def destroy
        @messenger = Messenger.find(params[:id])
        @messenger.destroy
---
SELECT "messengers".* FROM "messengers" WHERE "messengers"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "messengers" WHERE "messengers"."id" = ?  [["id", 15]]