blog/app/controllers/private_messages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "messengers".* FROM "messengers" WHERE "messengers"."user_id" = ? LIMIT ?  [["user_id", 17], ["LIMIT", 1]]
SELECT "private_messages".* FROM "private_messages" WHERE ("private_messages"."user_id" = ? AND "private_messages"."to_user_id" = ? OR "private_messages"."user_id" = ? AND "private_messages"."to_user_id" = ?) ORDER BY created_at DESC  [["user_id", 17], ["to_user_id", 18], ["user_id", 18], ["to_user_id", 17]]
UPDATE "messengers" SET "saw_last" = ?, "updated_at" = ? WHERE "messengers"."id" = ?  [["saw_last", 1], ["updated_at", "2024-09-05 15:50:12.184496"], ["id", 7]]
---
  def show
    #@messenger = Messenger.find(params[:id])
    @cur_user = User.find_by(id:params[:id])
    @to_user = User.find_by(id:params[:id])
    @messenger = Messenger.find_by(user_id:session[:user_id])
    @messages = PrivateMessage.where(user_id: session[:user_id], to_user_id:@to_user.id).or(PrivateMessage.where(user_id: @to_user.id, to_user_id:session[:user_id])).order('created_at ASC')
    @new_message = PrivateMessage.new(user_id: session[:user_id] , to_user_id:@to_user.id)
    @messenger.update(saw_last:true)

SELECT "messengers".* FROM "messengers" WHERE "messengers"."user_id" = ? AND "messengers"."to_user_id" = ? LIMIT ?  [["user_id", 17], ["to_user_id", 18], ["LIMIT", 1]]
INSERT INTO "private_messages" ("user_id", "to_user_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 17], ["to_user_id", 18], ["text", "first12"], ["created_at", "2024-09-05 15:50:23.572211"], ["updated_at", "2024-09-05 15:50:23.572211"]]
SELECT "messengers".* FROM "messengers" WHERE "messengers"."user_id" = ? AND "messengers"."to_user_id" = ?  [["user_id", 17], ["to_user_id", 18]]
UPDATE "messengers" SET "saw_last" = ?, "updated_at" = ? WHERE "messengers"."id" = ?  [["saw_last", 0], ["updated_at", "2024-09-05 16:20:51.763746"], ["id", 13]]
INSERT INTO "private_messages" ("user_id", "to_user_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 17], ["to_user_id", 18], ["text", "1"], ["created_at", "2024-09-05 16:20:51.775703"], ["updated_at", "2024-09-05 16:20:51.775703"]]
INSERT INTO "messengers" ("user_id", "to_user_id", "status", "saw_last", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 18], ["to_user_id", 17], ["status", "messenger"], ["saw_last", 0], ["created_at", "2024-09-05 20:04:06.764195"], ["updated_at", "2024-09-05 20:04:06.764195"]]
UPDATE "messengers" SET "saw_last" = ?, "updated_at" = ? WHERE "messengers"."id" = ?  [["saw_last", 0], ["updated_at", "2024-09-05 20:01:53.939489"], ["id", 14]]
---
  def create
    @prv_msg = PrivateMessage.new(message_params)
    @to_user = Messenger.where(user_id:params[:private_message][:to_user_id],to_user_id:params[:private_message][:user_id])
    if @prv_msg.save
      if @to_user.blank?
        @to_user = Messenger.new(user_id:params[:private_message][:to_user_id],to_user_id:params[:private_message][:user_id],status:'messenger',saw_last:false)
        @to_user.save
        redirect_to  request.referrer
      else
        @to_user.update(saw_last:false)