blog/app/controllers/private_messages_controller.rb

  def show
    @message = PrivateMessage.all
---
SELECT "private_messages".* FROM "private_messages"