blog/app/controllers/teams_controller.rb

  def index
    @teams = Team.all
    @current_user = User.find_by_id(session[:user_id]) #<%= @current_user.username %>
---
SELECT "teams".* FROM "teams"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

  def show
    @team = Team.find(params[:id])
    @current_user = User.find_by_id(session[:user_id])
    @owner_user = User.find_by_id(@team.owner_id)


    @my_team = UserTeam.where(team_id:params[:id] , user_id: session[:user_id])
    if @my_team.blank?
      @last_saw = DateTime.current
      @my_team = UserTeam.new(team_id:params[:id] , user_id: session[:user_id] ,saw_last:true,last_message:DateTime.current)
      @my_team.save
    else
      @last_saw = @my_team.last.last_message
      @my_team.update(saw_last:true,last_message:DateTime.current)
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."team_id" = ? AND "user_teams"."user_id" = ?  [["team_id", 2], ["user_id", 17]]
SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."team_id" = ? AND "user_teams"."user_id" = ?  [["team_id", 3], ["user_id", 18]]
UPDATE "user_teams" SET "last_message" = ?, "saw_last" = ?, "updated_at" = ? WHERE "user_teams"."id" = ?  [["last_message", "2024-09-06 15:17:36.821469"], ["saw_last", 1], ["updated_at", "2024-09-06 15:17:36.821880"], ["id", 22]]
INSERT INTO "user_teams" ("team_id", "user_id", "status", "last_message", "saw_last", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["team_id", 2], ["user_id", 17], ["status", nil], ["last_message", nil], ["saw_last", 1], ["created_at", "2024-09-06 14:01:46.094828"], ["updated_at", "2024-09-06 14:01:46.094828"]]

  def create
    @team = Team.new(team_params)

    if @team.save
---
INSERT INTO "teams" ("title", "owner_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "123"], ["owner_id", 18], ["status", "public"], ["created_at", "2024-09-05 22:17:34.559669"], ["updated_at", "2024-09-05 22:17:34.559669"]]

  def edit
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]