blog/app/controllers/team_posts_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "team_posts" ("team_id", "user_id", "post", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["team_id", 2], ["user_id", 17], ["post", "11"], ["created_at", "2024-09-06 14:15:58.613535"], ["updated_at", "2024-09-06 14:15:58.613535"]]
SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."team_id" = ?  [["team_id", 2]]
UPDATE "user_teams" SET "saw_last" = ?, "updated_at" = ? WHERE "user_teams"."id" = ?  [["saw_last", 0], ["updated_at", "2024-09-06 14:15:58.618459"], ["id", 4]]
SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."user_id" = ? AND "user_teams"."team_id" = ?  [["user_id", 17], ["team_id", 2]]
UPDATE "user_teams" SET "saw_last" = ?, "updated_at" = ? WHERE "user_teams"."id" = ?  [["saw_last", 1], ["updated_at", "2024-09-06 14:15:58.630062"], ["id", 4]]
---
  def create
    @team = Team.find(params[:team_id])
    @post = @team.team_posts.create(post_params)

    @team_members = UserTeam.where(team_id:params[:team_id])
    @team_members.update(saw_last:false)

    @team_members = UserTeam.where(user_id:session[:user_id],team_id:params[:team_id])
    @team_members.update(saw_last:true)#I have seen this post

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def destroy
    @team = Team.find(params[:team_id])