blog/app/controllers/users_controller.rb

      def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "password", "name", "created_at", "updated_at", "password_digest", "password_confirmation") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"