blog/app/controllers/user_teams_controller.rb

  def index
    #@myteams = UserTeam.where(user_id:session[:user_id])
    @myteams = Team.includes(:user_teams).where("user_teams.user_id" => session[:user_id])
---
SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."team_id" = ? AND "user_teams"."user_id" = ? LIMIT ?  [["team_id", 3], ["user_id", 17], ["LIMIT", 1]]

  def destroy
    @myteam = UserTeam.find(params[:id])
    @myteam.destroy
---
SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "user_teams" WHERE "user_teams"."id" = ?  [["id", 4]]