blog/app/views/team_posts/_team_post.html.erb

<% if team_post.post.include?(@search) %>
---
SELECT "team_posts".* FROM "team_posts" WHERE "team_posts"."team_id" = ?  [["team_id", 4]]

<p style="color: green">
<% elsif team_post.created_at >= @last_saw%>
---
INSERT INTO "user_teams" ("team_id", "user_id", "status", "last_message", "saw_last", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["team_id", 2], ["user_id", 17], ["status", nil], ["last_message", nil], ["saw_last", 1], ["created_at", "2024-09-06 14:15:58.655310"], ["updated_at", "2024-09-06 14:15:58.655310"]]


<%= User.find_by(id:team_post.user_id).username %><strong>-></strong><%= team_post.post %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]