blog/app/views/private_messages/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
<h1>Message to
<%if !User.where(id: params[:id]).blank?%>