blog/app/views/messengers/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
      <li>
      <%if !User.where(id: messenger.to_user_id).blank?%>
        <%= User.find_by(id: messenger.to_user_id).username %>
        <%= link_to "Send a message" , private_message_path(User.find_by(id: messenger.to_user_id).id) %>

SELECT "messengers".* FROM "messengers" WHERE "messengers"."user_id" = ?  [["user_id", 17]]
---
        <% end %>
        <%= link_to "Block", messengers_block_path(Messenger.find_by(id:messenger.id).to_user_id) %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
      <li>
      <%if !User.where(id: messenger.to_user_id).blank?%>

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      <li>
        <%= Team.find_by(id: messenger.team_id).title %>